package Homework3;

public class Task6 {
    /* 6)Используя оператор switch написать программу, которая выводит на консоль ссылку для скачивания программы.
    Из выбора программ взять: IntelliJ IDEA, Git, Java. Из выбора ОС взять: Linux, macOS, Windows. Программа должна
    спросить пользователя какая программа ему интересна, также спросить какую ОС он использует, а после вывести в
    консоль необходимую ссылку. Если программа с таким названием не существует выводит сообщение в консоль, о том
    что такой программы не существует. Если указанной пользователем ОС нет, то выводится сообщение в консоль, о том ч
    то такой ОС не существует. */

}
